Catalogs/Renault_МодулиДляВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_МодулиДляВыполнения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ВидыВыполненияМодулей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийИзменивший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТаблицы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Строка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеБД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_НастройкаРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_НастройкаРегламентныхЗаданий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ИспользованиеРегЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Renault_СерверныеФункции/Ext/Module.bsl
// Функция получает расписание регл. задания. Если регл. задание не задано, то возвращает "Неопределено"
//
Функция ПолучитьРасписаниеВыполненияОбменаДанными(ВнешняяОбработка) Экспорт
	
	// возвращаемое значение функции
	РасписаниеРегламентногоЗадания = Неопределено;
	
	РегламентноеЗаданиеОбъект = Renault_ВнешниеОбработкиСервер.НайтиРегламентноеЗаданиеПоПараметру(ВнешняяОбработка.РегламентноеЗаданиеGUID);
	
	Если РегламентноеЗаданиеОбъект <> Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = РегламентноеЗаданиеОбъект.Расписание;
		
	КонецЕсли;
	
	Возврат ЗначениеВСтрокуВнутр(РасписаниеРегламентногоЗадания);
	
КонецФункции

Процедура ВыполнениеВнешнихОбработок(ВнешняяОбработка) Экспорт
	
	Если Не ЗначениеЗаполнено(ВнешняяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьВнешнююОбработку(ВнешняяОбработка);
	
КонецПроцедуры

// Выполняет внешнюю обработку
//
Процедура ВыполнитьВнешнююОбработку(ВнешняяОбработка)
	
	Если ТипЗнч(ВнешняяОбработка) = Тип("СправочникСсылка.Renault_МодулиДляВыполнения") Тогда
		
		МодульОбъект = ВнешняяОбработка.ПолучитьОбъект();
		
		КлючСообщенияПротокола = "Модуль для выполнения." + МодульОбъект.Наименование + " (Код: " + МодульОбъект.Код + ")";
		
		Попытка
			
			МодульОбъект.ВыполнитьМодуль();
			
		Исключение
			СтрокаСообщенияОбОшибке =
			"При вызове процедуры ВыполнитьМодуль() произошла ошибка: " + ОписаниеОшибки();
			
			ЗаписьЖурналаРегистрации(
				КлючСообщенияПротокола, УровеньЖурналаРегистрации.Ошибка,,
				ВнешняяОбработка,
				СтрокаСообщенияОбОшибке);
			
		КонецПопытки;
		
		ЗаписьЖурналаРегистрации(
		КлючСообщенияПротокола, УровеньЖурналаРегистрации.Информация,,
		ВнешняяОбработка,
		"Закончено выполнение внешней обработки");
		
		Если МодульОбъект.Наименование = Справочники.Renault_МодулиДляВыполнения.UPD.Наименование Тогда
			РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
			ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ВыполнениеВнешнихОбработокUPD"),
			ТекущаяДатаСеанса());
		ИначеЕсли МодульОбъект.Наименование = Справочники.Renault_МодулиДляВыполнения.RLD.Наименование Тогда
			РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
			ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ВыполнениеВнешнихОбработокRLD"),
			ТекущаяДатаСеанса());
			
		КонецЕсли;
	КонецЕсли;  
		
	
КонецПроцедуры

// Функция возвращает существующее или создает новое регламентное задание для переданного объекта
//
Функция СоздатьРегламентноеЗаданиеПриНеобходимости(Отказ, РегламентноеЗаданиеGUID)
	
	РегламентноеЗаданиеОбъект = Renault_ВнешниеОбработкиСервер.НайтиРегламентноеЗаданиеПоПараметру(РегламентноеЗаданиеGUID);
	
	// при необходимости создаем регл. задание
	Если РегламентноеЗаданиеОбъект = Неопределено Тогда
		
		РегламентноеЗаданиеОбъект = РегламентныеЗадания.СоздатьРегламентноеЗадание("Renault_ВыполнениеВнешнихОбработок");
		
	КонецЕсли;
	
	Возврат РегламентноеЗаданиеОбъект;
	
КонецФункции

// Процедура устанавливает параметры регл. задания для переданного объекта
//
Процедура УстановитьПараметрыРегламентногоЗадания(РегламентноеЗаданиеОбъект, РасписаниеРегламентногоЗадания, Ссылка, Наименование, ИспользоватьРегламентноеЗадание)
	
	ПараметрыРегламентногоЗадания = Новый Массив;
	ПараметрыРегламентногоЗадания.Добавить(Ссылка);
	
	НаименованиеРегламентногоЗадания =
	"Выполнение: " + ТипЗнч(Ссылка) + ", Наименование: " + СокрЛП(Наименование) + ", Код: " + СокрЛП(Ссылка.Код);
	
	РегламентноеЗаданиеОбъект.Наименование	= Лев(НаименованиеРегламентногоЗадания, 120);
	РегламентноеЗаданиеОбъект.Использование	= ИспользоватьРегламентноеЗадание;
	РегламентноеЗаданиеОбъект.Параметры		= ПараметрыРегламентногоЗадания;
	
	// обновляем расписание, если оно было изменено
	Если РасписаниеРегламентногоЗадания <> Неопределено Тогда
		РегламентноеЗаданиеОбъект.Расписание = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Попытка 
		РегламентноеЗаданиеОбъект.Записать();
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

// Функция сохраняет регламентное задание и возвращает его уникальный идентифакатор
//
Функция ОбновитьДанныеРегламентногоЗадания(Отказ, РасписаниеРегламентногоЗадания, Ссылка, Наименование, ИспользоватьРегламентноеЗадание, РегламентноеЗаданиеGUID) Экспорт
	
	// получаем регламентное задание по идентификатору, если объект не находим, то создаем новый
	РегламентноеЗаданиеОбъект = СоздатьРегламентноеЗаданиеПриНеобходимости(Отказ, РегламентноеЗаданиеGUID);
	
	Если Отказ Тогда
		Возврат РегламентноеЗаданиеGUID;
	КонецЕсли;
	
	// обновляем свойства РЗ
	УстановитьПараметрыРегламентногоЗадания(РегламентноеЗаданиеОбъект, ЗначениеИзСтрокиВнутр(РасписаниеРегламентногоЗадания), Ссылка, Наименование, ИспользоватьРегламентноеЗадание);
	
	// записываем измененное задание
	Renault_ВнешниеОбработкиСервер.ЗаписатьРегламентноеЗадание(Отказ, РегламентноеЗаданиеОбъект);
	
	// Возвращаем GUID регл. задания в реквизит объекта (РегламентноеЗаданиеGUID)
	Возврат Строка(РегламентноеЗаданиеОбъект.УникальныйИдентификатор);
	
КонецФункции

Процедура ВыполнитьМетодКонфигурации(Знач ИмяЭкспортнойПроцедуры, Знач Параметры = Неопределено) Экспорт
	
	ПараметрыСтрока = "";
	Если Параметры <> Неопределено И Параметры.Количество() > 0 Тогда
		Для Индекс = 0 По Параметры.ВГраница() Цикл 
			ПараметрыСтрока = ПараметрыСтрока + "Параметры[" + Индекс + "],";
		КонецЦикла;
		ПараметрыСтрока = Сред(ПараметрыСтрока, 1, СтрДлина(ПараметрыСтрока) - 1);
	КонецЕсли;
	
	Выполнить ИмяЭкспортнойПроцедуры + "(" + ПараметрыСтрока + ")";
	
КонецПроцедуры
